tutorials/settlingFoam/dahl/0/alpha
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform 0.001;
    }

    outlet          
    {
        type            zeroGradient;
    }

    bottomWall      
    {
        type            zeroGradient;
    }

    endWall         
    {
        type            zeroGradient;
    }

    top             
    {
        type            symmetryPlane;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
